app/views/book/edit.html.erb

SELECT `subjects`.* FROM `subjects`
---
    <p>Price: <%= f.text_field  'price' %></p>
    <p>Subject: <%= f.collection_select :subject_id, Subject.all, :id, :name %></p>