app/views/book/list.html.erb

SELECT `subjects`.* FROM `subjects`
---
<ul id = "subjects">
  <% Subject.all.each do |c| %>