app/controllers/book_controller.rb

	def list
      @books = Book.all
---
SELECT `books`.* FROM `books`

   def show
      @book = Book.find(params[:id])
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1

   def new
      @book = Book.new
      @subjects = Subject.all
---
SELECT `subjects`.* FROM `subjects`

   def create
      @book = Book.new(book_params)

      if @book.save
         redirect_to :action => 'list'
      else
         @subjects = Subject.all
---
INSERT INTO `books` (`title`, `price`, `subject_id`, `description`, `created_at`) VALUES ('something', 12.0, 2, 'fasdfasdfasdfa', '2017-03-13 12:11:48')
SELECT `subjects`.* FROM `subjects`

   def edit
      @book = Book.find(params[:id])
      @subjects = Subject.all
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
SELECT `subjects`.* FROM `subjects`

   def update
      @book = Book.find(params[:id])

      if @book.update_attributes(book_param)
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
UPDATE `books` SET `title` = 'Modern Physics', `price` = 10.0 WHERE `books`.`id` = 3

   def delete
      Book.find(params[:id]).destroy
---
DELETE FROM `books` WHERE `books`.`id` = 1
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1

   def show_subjects
      @subject = Subject.find(params[:id])
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1